Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo.IsNumberingChanged Field
 Whether the numbering of object has changed.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public readonly bool IsNumberingChanged
Public ReadOnly IsNumberingChanged As Boolean
Field Value
Type: Boolean
true if the numbering of object has changed; otherwise, false.
Remarks
 True only if the object has been re-numbered. Modifications to object which require re-numbering are only indicated with IsModified.
See Also
Reference
ModifiedObjectInfo Structure
Tekla.Structures.Model.History Namespace